package pm;

public class BfTest {

	public static void main(String[] args) {
		// 1번 문제
		// 정수형 x에 10을, 정수형 y에 20을 저장하고.
		// 정수형 z에 증가연산자 x 와 y 감소연산자를 더한 값을 저장한 후
		// z값을 출력하라.
		
		
		
		
		
		
		
		
		// 2번 문제
		// 정수형 score에 85를 저장하고
		// 문자열형 result에 score가 90 초과인지 확인하는 조건문을 통해
		// 참일 경우 "가"를 거짓일 경우 "나"를 저장한 후
		// result값을 출력하라.
		
		
		
		
		
		
		
		// 3번 문제
		// 정수형 pencils에 534을, 정수형 students에 30을 저장하고.
		// 정수형 pencilsPerStudent에 학생(students) 한 명이 가지는 연필 수를 구하여 저장한 후 해당 값을 출력하라. 
		// 그 후 정수형 pencilsLeft에 남은 연필 수를 구하고 저장한 후 해당 값을 출력하라.
		
		
		
		
		
		
		
		// 4번 문제
		// 정수형 value에 356을 저장하고.
		// value의 십의 자리 이하를 버린 값을 구한 후 출력하라.
		
		
		
		
		
		
		
		// 5번 문제
		// 정수형 lengthTop에 5를 저장하고,
		// 정수형 lengthBottom에 10을 저장하고,
		// 정수형 height에 7를 저장하고,
		// 실수형 area에 정확히 소수 자릿수가 나올 수 있도록 하는 사다리꼴 넓이 연산식을 통해 구한 값을 저장한 후
		// area 값을 출력하라.
		
		
		
		
		
		
		
		// 6번 문제
		// 정수형 x에 10을, 정수형 y에 5를 저장하고.
		// (x가7보다 크다는 비교연산식)과 (y가5보다 작거나 같다는 비교연산식)의 논리곱 값을 출력하고,
		// ((x를 3으로 나눈 나머지 값)이 2와 같다는 비교연산식)과
		// ((y를 2로 나눈 나머지 값)이 1과 같지않다는 비교연산식)의 논리합 값을 출력하라.
		
		
		
		
		
		
		
		// 7번 문제
		// 정수형 x에 10을, 정수형 y에 20을 저장하고.
		// 정수형 z에 증가연산자 x 와 y 감소연산자를 더한 값을 저장한 후
		// z값을 출력하라.
		
		
		
		
		
		
		
		
	}

}
